KCX-Mapping-Convert/testdaten/EMCS-V20/UidsFromKids/EMCSChangeOfDestination.xml

<?xml version="1.0" encoding="UTF-8"?><soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header><Header xmlns="http://www.eurtradenet.com/schemas/header/200310" soap:mustUnderstand="true"><To>DE01.CSFALT.2144</To><From>DE.CSF</From><MessageID>DE01DE01214420100510120200000001</MessageID><SentAt>2011-08-19 12:02:00 +0200</SentAt><Act>request</Act><Method>EMCS</Method><MessageVersion>2.0</MessageVersion><MessageType>EMCSChgOfDestinationInfo</MessageType></Header></soap:Header><soap:Body><Submit xmlns="http://www.eurtradenet.com/schemas/uids/emcs/body/200911"><EMCS><EMCSChgOfDestinationInfo><LocalReferenceNumber>ReferenceNumber</LocalReferenceNumber><UpdateEaad><AddReferenceCode>AadReferenceCode</AddReferenceCode><JourneyTime>123400</JourneyTime><ChangedTransportArrangement>ChangedTransportArrangement</ChangedTransportArrangement><SequenceNumber>1</SequenceNumber><InvoiceDate>1967-08-13</InvoiceDate><InvoiceNumber>InvoiceNumber</InvoiceNumber><TransportModeCode>TransportModeCode</TransportModeCode></UpdateEaad><DateAndTimeOfValidationOfEaad>2010-04-14T12:12:00+0200</DateAndTimeOfValidationOfEaad><NewTransportArrangerTrader><CustomerID>CustomerID-TA</CustomerID><VATID>VATID-TA</VATID><Address><Name>Name-TA</Name><Street>StreetAndNumber-TA</Street><StreetNumber>1ta</StreetNumber><PostalCode>PostalCode-TA</PostalCode><City>City-TA</City><Language>TA</Language></Address></NewTransportArrangerTrader><NewTransporterTrader><CustomerID>CustomerID-FT</CustomerID><VATID>VATID-FT</VATID><Address><Name>Name-FT</Name><Street>StreetAndNumber-FT</Street><StreetNumber>1ft</StreetNumber><PostalCode>PostalCode-FT</PostalCode><City>City-FT</City><Language>FT</Language></Address></NewTransporterTrader><ChangedDestination><DestinationTypeCode>DestinationTypeCode</DestinationTypeCode><NewConsigneeTrader><CustomerID>CustomerID-TA</CustomerID><VATID>VATID-TA</VATID><Address><Name>Name-TA</Name><Street>StreetAndNumber-TA</Street><StreetNumber>1ta</StreetNumber><PostalCode>PostalCode-TA</PostalCode><City>City-TA</City><Language>TA</Language></Address></NewConsigneeTrader><DeliveryPlaceTrader><CustomerID>CustomerID-FT</CustomerID><VATID>VATID-FT</VATID><Address><Name>Name-FT</Name><Street>StreetAndNumber-FT</Street><StreetNumber>1ft</StreetNumber><PostalCode>PostalCode-FT</PostalCode><City>City-FT</City><Language>FT</Language></Address></DeliveryPlaceTrader><DeliveryPlaceCustomsOffice>DeliveryPlaceCustomsOffice</DeliveryPlaceCustomsOffice></ChangedDestination><TransportDetails><TransportUnitCode>2</TransportUnitCode><IdentityOfTransportUnits>IdentityOfTransportUnits</IdentityOfTransportUnits><CommercialSealIdentification>CommercialSealIdentification</CommercialSealIdentification><ComplementaryInformation language="AA">ComplementaryInformation</ComplementaryInformation><SealInformation language="AA">SealInformation</SealInformation></TransportDetails></EMCSChgOfDestinationInfo></EMCS></Submit></soap:Body></soap:Envelope>
